{"q":"I have a cough—what should I do?","ideal":"1) What you can try now:\n- Rest, drink warm fluids, and use a humidifier or steam to loosen mucus.\n- Honey 1–2 tsp up to a few times daily can soothe cough (not for children <1 year). \n- Avoid smoke/irritants; consider an OTC cough lozenge. \n- If post-nasal drip: saline nasal rinse; consider a non-drowsy antihistamine if allergies suspected. \n- If reflux symptoms at night: avoid late meals; elevate head of bed.\n\n2) When to seek urgent care:\n- Trouble breathing, chest pain/pressure, lips/face turning blue.\n- High fever (≥102°F / 39°C) lasting >3 days, confusion, or severe weakness.\n- Coughing up blood or rust-colored sputum; symptoms after choking event.\n- Worsening cough >3–4 weeks or underlying lung/heart disease with new symptoms.\n\n3) What to track or share with a clinician:\n- Onset and duration, fever pattern, nighttime vs daytime cough, triggers.\n- Sputum color/amount, associated symptoms (wheezing, heartburn, sore throat).\n- Sick contacts, recent travel, smoking/vape exposure, current meds. \n\nThis is general information, not medical care."}
{"q":"I keep getting heartburn after I eat. What should I do?","ideal":"1) What you can try now:\n- Smaller meals; avoid late eating (finish ≥3 hours before bed).\n- Limit triggers: fatty/spicy foods, citrus, tomato, chocolate, caffeine, alcohol, mint.\n- Elevate head of bed 6–8 inches for nighttime symptoms.\n- Consider an antacid for quick relief or an OTC H2 blocker (e.g., famotidine) before trigger meals if appropriate.\n\n2) When to seek urgent care:\n- Chest pain with sweating, shortness of breath, or radiating pain (rule out heart causes).\n- Vomiting blood, black stools, unexplained weight loss, trouble swallowing, food getting stuck.\n- Persistent symptoms >2–4 weeks despite lifestyle changes/OTC meds.\n\n3) What to track or share with a clinician:\n- Foods/triggers, timing vs meals/lying down, response to OTCs.\n- Any nausea, vomiting, trouble swallowing, cough/hoarseness.\n- Current meds (e.g., NSAIDs), alcohol/tobacco use, pregnancy status.\n\nThis is general information, not medical care."}
{"q":"My leg hurts but I don’t remember injuring it. What should I do?","ideal":"1) What you can try now:\n- Rest the leg; elevate and apply ice 10–15 min at a time for soreness/swelling.\n- Gentle stretching if not acutely painful; avoid activities that worsen pain.\n- Consider acetaminophen or (if appropriate) ibuprofen following label directions.\n- Check footwear/support; consider brief use of a compression sleeve if swelling.\n\n2) When to seek urgent care:\n- One leg becomes swollen, warm, red, and tender (concern for blood clot), especially with calf pain.\n- Sudden severe pain, inability to bear weight, numbness/weakness, or deformity.\n- Fever, chills, or skin streaking (possible infection); recent surgery/immobilization with new leg pain.\n\n3) What to track or share with a clinician:\n- Exact location/character of pain, what worsens/relieves it, morning vs evening pattern.\n- Swelling, redness, warmth, tingling, or color changes.\n- Recent long travel, new meds (e.g., hormones), personal/family clotting history.\n\nThis is general information, not medical care."}
{"q":"I have chest discomfort when I walk upstairs. What should I do?","ideal":"1) What you can try now:\n- Stop the activity immediately; rest and note if symptoms resolve with rest.\n- Avoid exertion until evaluated. If you have prescribed nitroglycerin, follow your clinician’s instructions.\n\n2) When to seek urgent care:\n- Call emergency services now if chest pressure/tightness occurs with exertion, or if pain radiates to arm/jaw/back, or is accompanied by shortness of breath, sweating, nausea, lightheadedness.\n- Urgent evaluation if new/worsening exertional chest pain even if it eases with rest.\n\n3) What to track or share with a clinician:\n- Onset, triggers (stairs, cold air, after meals), duration, relief with rest.\n- Associated symptoms (SOB, nausea, sweating), risk factors (age, BP, diabetes, cholesterol, smoking, family history).\n- Current meds and any recent changes.\n\nThis is general information, not medical care."}
{"q":"I have burning when I pee. What should I do?","ideal":"1) What you can try now:\n- Hydrate with water; avoid bladder irritants (caffeine, alcohol, spicy foods).\n- Consider short-term urinary pain relief (phenazopyridine) if appropriate; it can discolor urine orange.\n- For people with vaginal symptoms (itch/discharge), yeast or vaginitis could be involved—avoid douches; gentle hygiene only.\n\n2) When to seek urgent care:\n- Fever, flank/back pain, nausea/vomiting (possible kidney infection).\n- Blood in urine, inability to pass urine, severe pelvic/abdominal pain.\n- Pregnancy, recurrent infections, or symptoms not improving within 24–48 hours.\n\n3) What to track or share with a clinician:\n- Onset, frequency/urgency, visible blood, odor/cloudiness, sexual activity/new partner.\n- Any discharge, fever/chills, back pain; prior UTIs and antibiotic responses.\n- Current medications and allergies.\n\nThis is general information, not medical care."}
{"q":"I have a bad headache. What should I do?","ideal":"1) What you can try now:\n- Rest in a dark, quiet room; hydrate. Try acetaminophen or (if appropriate) ibuprofen per label.\n- Small amount of caffeine can help some headaches; avoid overuse.\n- Identify triggers (missed meals, dehydration, stress, poor sleep). Gentle neck/shoulder stretches if tension.\n\n2) When to seek urgent care:\n- “Worst ever” sudden headache (thunderclap), new neurological symptoms (weakness, numbness, trouble speaking/seeing), confusion, fainting.\n- Fever with stiff neck/rash, head injury, new severe headache in pregnancy or with cancer/immunosuppression.\n- Headache progressively worsening over days or new after age 50.\n\n3) What to track or share with a clinician:\n- Onset, location/quality (throbbing/pressure), sensitivity to light/sound, nausea.\n- Triggers, relief measures tried, response to meds.\n- Headache diary: timing, duration, associated menstrual cycle/stress/sleep.\n\nThis is general information, not medical care."}
{"q":"I feel short of breath. What should I do?","ideal":"1) What you can try now:\n- Sit upright, loosen tight clothing, use pursed-lip breathing (inhale 2 sec, exhale 4 sec).\n- If you have an inhaler or home oxygen prescribed, use as directed.\n- Avoid exertion until symptoms settle; consider a cool fan/airflow.\n\n2) When to seek urgent care:\n- Severe, sudden, or worsening shortness of breath; blue lips/face; confusion; chest pain; fainting.\n- Wheeze with no relief from usual meds; swelling in one leg with chest pain (possible clot); high fever, productive cough with rust-colored sputum.\n\n3) What to track or share with a clinician:\n- Onset (sudden vs gradual), triggers (exercise, lying flat, allergens), associated cough/fever/chest pain.\n- Past lung/heart history (asthma, COPD, heart disease), smoking/vaping.\n- Home readings if available: pulse oximeter, temperature, peak flow.\n\nThis is general information, not medical care."}
{"q":"I have a new rash. What should I do?","ideal":"1) What you can try now:\n- Gentle skin care: lukewarm water, mild soap, pat dry; avoid scratching.\n- For itch, consider oral antihistamine (non-drowsy by day) and 1% hydrocortisone cream for limited areas if skin not broken.\n- Avoid new products/metals/plants that could be triggers; cool compresses can help.\n\n2) When to seek urgent care:\n- Rash with trouble breathing, swelling of lips/tongue, or widespread hives (possible severe allergy).\n- Painful spreading redness, pus, fever (infection); rash on face/eyes or genitals; purple spots/bruising without injury.\n- Rash with high fever, stiff neck, or widespread blistering/peeling.\n\n3) What to track or share with a clinician:\n- Onset, spread, itch/pain level, recent exposures (new meds, foods, products, plants, travel, sick contacts, insect bites).\n- Photos over time; response to any creams/antihistamines.\n- Other symptoms (fever, sore throat, joint pain).\n\nThis is general information, not medical care."}
